/*
  Створити таблицю users
    в таблиці мають бути всі стовпчики, що є у мене, а також:
      - вага
      - рейтинг

    В таблиці мають бути прописані наступні обмеження на додачу до існуючих:
      - Пара стовпчиків ім'я та прізвища має бути унікальною
      - Переробити обмеження для імені та прізвища. Повне ім'я не має дорівнювати пустому рядку. Напишіть через обмеження таблиці
      - вага користувача має бути у межах діапазону від 0 до 500
      - Новим обмеженням дати людиночитаємі назви
      - рейтинг має коливатися від 1 до 5

*/