/*
  Класифікації зв'язків між сутностями:

    по кількості сутностей у зв'язку:
      - унарні (посилання запису з таблиці на інший запис с цієї таблиці 
      | відповідь на повідомлення)
      - бінарний (запис з однієї таблиці посилається запис з іншої 
      | студент - екзамен | екзамен - дисципліна
      )
      - тернарний (набагато рідший, досить часто можна перетворити на бінарний)

    Вид зв'язку:
      - 1 : 1 ( людина - ідентифікаційний код, машина - водій)
      - 1 : m (найчастіший, один викладач - багато груп, один автор - багато книг, один тімлід - багато проектів)
      - m : n (чати- користувачі, замовлення - товари)

    По обов'язковості:
    - Жорсткі (обов'язкові, 1)
    - Нежорсткі (необов'язкові, 0)
    машина 0 : 0 водій
    людина 1 : 0 ідентифікаційний код

*/