-- коментар
/*
  коментар
*/

/*
  команда
  CREATE, TABLE - ключові слова (за узгодженням пишуться капсом)
  vip_users - ідентифікатори / імена (пробіли замінюються _)
  "VIP USERS" - ідентифікатори можна писати в подвійких лапках, тоді вони запам'ятовуються SQL так як в лапках


  команди завжди завершуть ;
  SQL переводить команди перед виконанням в нижній регістр.
  
*/
CREATE TABLE users();

DROP TABLE users;

-- строкові константи завжди використовуються '
'some text'

'комп''ютер' -- екранування '

-- можна переносити частини на наступний рядок, воно збереться
'комп'
'ютер'

-- postgresql унікальні строкові константи
$$комп'ютер$$

$$'$$

-- numbers
42
3.5
4.
.001
5e2
1.925e-3

-- приведення типів
number '1.25';
'1.5'::number; -- postgres only
CAST ('1.5' AS number);




